
import random                                                    #
                                                                 # 
                                                                 # 
c1 = int(input('Введите шанс на появление числа 1 : '))          # <--\
c2 = int(input('Введите шанс на появление числа 2 : '))          # <-- } Шансы
c3 = int(input('Введите шанс на появление числа 3 : '))          # <--/
                                                                 # 
                                                                 # 
                                                                 # 
while True:                                                      # 
                                                                 # 
                                                                 # 
	print('Шансы ',c1,':',c2,':',c3,' ')                         # 
	change_c=input()                                             # <--\ 
	if change_c == 'c':                                          # <---\ Смена шансов
		c1 = int(input('Введите шанс на появление числа 1 : '))  # <--\
		c2 = int(input('Введите шанс на появление числа 2 : '))  # <-- } Шансы
		c3 = int(input('Введите шанс на появление числа 3 : '))  # <--/
	c_max = c1+c2+c3                                             # 
                                                                 # 
	print('     -----------------------')                        # <--\
	print('     | ', end='')                                     # <---\ Рамка
                                                                 # 
	for i in 'iiiiiiiiii':                                       # <-- цикл для повторения кода 10 раз
		chanse = random.randint(1,c_max)                         # Рандомное число от 1 до суммы шансов  \
                                                                 #                                        |
		if 0<chanse<c1+1:                                        #                                        |
			print(1, end=' ')                                    #                                        |
                                                                 #                                        |
		if c1<chanse<c1+c2+1:                                    #                                        |
			print(2, end=' ')                                    #                                         > Выбор нужного числа в зависимости от шансов
                                                                 #                                        |
		if c1+c2<chanse<c1+c2+c3+1:                              #                                        |
			print(3, end=' ')                                    #                                        |
                                                                 #                                        |
		chanse = 0                                               #                                        |
                                                                 #                                       /
	print('|')                                                   # <---/ Рамка
	print('     -----------------------')                        # <--/